In [1]:
import pandas as pd
import numpy as np
import janitor as jn
from janitor.utils import _generic_less_than_inequality, _generic_greater_than_inequality
from pandas.api.types import is_numeric_dtype, is_datetime64_dtype, is_string_dtype
from io import StringIO

In [4]:
df1 = pd.DataFrame(
    [
        {"x": "b", "y": 1, "v": 1},
        {"x": "b", "y": 3, "v": 2},
        # {"x": "b", "y": 2.3, "v": 2},
        {"x": "b", "y": 6, "v": 3},
        {"x": "a", "y": 1, "v": 4},
        {"x": "a", "y": 3, "v": 5},
        {"x": "a", "y": 6, "v": 6},
        {"x": "c", "y": 1, "v": 7},
        {"x": "c", "y": 3, "v": 8},
        {"x": "c", "y": 6, "v": 9},
        {"x": "c", "y": np.nan, "v": 9},
                # {"x": "b", "y": 3.5, "v": 2},

    ]
)

df2 = pd.DataFrame(
    [{"x": "c", "v": 8, "foo": 4}, {"x": "b", "v": 7, "foo": 2}, {"x": "b", "v": 7, "foo": None}]
)

df1.le_join(df2, 'y', 'foo', sort_by_appearance=True)

  x_x    y  v_x x_y  v_y  foo
0   b  1.0    1   c    8  4.0
1   b  1.0    1   b    7  2.0
2   b  3.0    2   c    8  4.0
3   a  1.0    4   c    8  4.0
4   a  1.0    4   b    7  2.0
5   a  3.0    5   c    8  4.0
6   c  1.0    7   c    8  4.0
7   c  1.0    7   b    7  2.0
8   c  3.0    8   c    8  4.0

In [5]:
df1

   x    y  v
0  b  1.0  1
1  b  3.0  2
2  b  6.0  3
3  a  1.0  4
4  a  3.0  5
5  a  6.0  6
6  c  1.0  7
7  c  3.0  8
8  c  6.0  9
9  c  NaN  9

In [6]:
df2

   x  v  foo
0  c  8  4.0
1  b  7  2.0
2  b  7  NaN

In [4]:
# df1.cond_merge(df2, ('y','foo','lt'), ('v','v', 'le'))

In [5]:
%load_ext line_profiler
%load_ext memory_profiler

In [6]:
df1 = pd.concat([df1]*1_000, ignore_index=True)
df2 = pd.concat([df2]*200, ignore_index = True)

In [7]:
%timeit df1.le_join(df2, 'y','foo')# .query("v_x >= v_y")

462 ms ± 40.1 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [8]:
# %timeit _conditional_merge_compute(df1, df2, [Inequality_Condition('y', 'foo', 'lt')], how='inner', suffixes=(None, "_y"))

In [9]:
_generic_greater_than_inequality(df1, df2, 'y', 'foo', strict = True)

        x_x    y  v_x x_y  v_y  foo
0         b  2.3    2   b    7  2.0
1         b  2.3    2   b    7  2.0
2         b  2.3    2   b    7  2.0
3         b  2.3    2   b    7  2.0
4         b  2.3    2   b    7  2.0
...      ..  ...  ...  ..  ...  ...
1799995   c  6.0    9   c    8  4.0
1799996   c  6.0    9   c    8  4.0
1799997   c  6.0    9   c    8  4.0
1799998   c  6.0    9   c    8  4.0
1799999   c  6.0    9   c    8  4.0

[1800000 rows x 6 columns]

In [10]:
%lprun -f  _generic_greater_than_inequality   _generic_greater_than_inequality(        df=df1, right=df2, left_on="v", right_on="v", strict=True)

Timer unit: 1e-06 s

Total time: 0 s
File: /workspaces/pyjanitor/janitor/utils.py
Function: _generic_less_than_inequality at line 2463

Line #      Hits         Time  Per Hit   % Time  Line Contents
==============================================================
  2463                                           def _generic_less_than_inequality(
  2464                                               df: pd.DataFrame,
  2465                                               right: pd.DataFrame,
  2466                                               left_on: str,
  2467                                               right_on: str,
  2468                                               sort_by_appearance:bool=False,
  2469                                               strict: bool = False,
  2470                                           ):
  2471                                               """
  2472                                               Generic implementation for less than joins.
  2473                                               This covers less than or equal joins as well.
  2474                                               If `strict` is True, then only rows where
  2475                                               the left side is strictly less than the right side
  2476                                               are kept.
  2477                                               If there are no matches, None is returned.
  2478                                               """
  2479
  2480                                               left_c = df[left_on]
  2481                                               right_c = right[right_on]
  2482
  2483
  2484                                               _conditional_join_type_check(left_c, right_c)
  2485
  2486                                               if left_c.min() > right_c.max():
  2487                                                   return None
  2488                                               right_argsort = right_c.argsort().to_numpy(copy=False)
  2489                                               exclude_rows = right_argsort == -1
  2490                                               if exclude_rows.any():
  2491                                                   right_c = right_c[~exclude_rows]
  2492                                                   right_argsort = right_argsort[~exclude_rows]
  2493                                               if not right_c.is_monotonic_increasing:
  2494                                                   right_c = right_c.take(right_argsort)
  2495                                               search_indices = right_c.searchsorted(left_c, side='left')
  2496                                               len_right_c = right_c.size
  2497                                               len_left = len_right_c - search_indices
  2498                                               right_indices = [np.arange(start, len_right_c) for start in search_indices]
  2499                                               right_indices = np.concatenate(right_indices)
  2500                                               left_marker = np.arange(search_indices.size)
  2501                                               right_marker = np.repeat(left_marker, len_left)
  2502                                               if strict is True:
  2503                                                   right_c = right_c.take(right_indices)
  2504                                                   left_c = left_c.repeat(len_left)
  2505                                                   exclude_rows = right_c.array == left_c.array
  2506                                                   right_c = right_c.index
  2507                                                   if exclude_rows.any():
  2508                                                       right_c = right_c[~exclude_rows]
  2509                                                       right_marker = right_marker[~exclude_rows]
  2510                                               else:
  2511                                                   right_c = right_c.index.take(right_indices)
  2512                                               if sort_by_appearance is True:
  2513                                                   ind = np.lexsort((right_c, right_marker))
  2514                                                   right_marker = right_marker[ind]
  2515                                                   right_c = right_c[ind]
  2516                                               right = right.take(right_c)
  2517                                               right.index = right_marker
  2518                                               df.index = left_marker
  2519                                               right = df.join(right, how ='inner', sort = False, lsuffix="_x", rsuffix="_y")
  2520                                               right.index = np.arange(len(right))
  2521                                               return right

In [11]:
%lprun -f jn.le_join jn.le_join(df1, df2, 'y', 'foo')

Timer unit: 1e-06 s

Total time: 0.378635 s
File: /workspaces/pyjanitor/janitor/functions.py
Function: le_join at line 6117

Line #      Hits         Time  Per Hit   % Time  Line Contents
==============================================================
  6117                                           @pf.register_dataframe_method
  6118                                           def le_join(
  6119                                               df: pd.DataFrame,
  6120                                               right: Union[pd.DataFrame, pd.Series],
  6121                                               left_on: str,
  6122                                               right_on: str,
  6123                                               sort_by_appearance:bool=False,
  6124                                               suffixes=("_x", "_y"),
  6125                                           ) -> pd.DataFrame:
  6126                                               """
  6127                                               Similar to ``pd.merge``, but supports only non-equi merge.
  6128                                               This returns rows where values for `left_on` from `df` are
  6129                                               less than or equal to values for `right_on` for `right`.
  6130                                               The function uses binary search to get these rows, avoiding
  6131                                               the cartesian product, to make non-equi joins faster and less
  6132                                               memory intensive. This allows for multiple non-equi joins, where subsequent
  6133                                               conditions can be achieved within the joined dataframe, via `pandas.query`,
  6134                                               or `pandas.loc`, using boolean masks.
  6135                                               The non-equi join is done only on the columns. MultiIndex columns are not supported.
  6136                                               Only inner join is supported.
  6137
  6138                                               .. note:: If `df` or `right` has labeled indices, it will be lost after the merge,
  6139                                                         and replaced with an integer index. If you wish to preserve the labeled indices,
  6140                                                         you can convert them to columns before running the non-equi join.
  6141                                               """
  6142
  6143         2       4126.0   2063.0      1.1      df, right, left_on, right_on, sort_by_appearance = _non_equi_preliminary_checks(
  6144         1          1.0      1.0      0.0          df, right, left_on, right_on, sort_by_appearance, suffixes
  6145                                               )
  6146
  6147         1        150.0    150.0      0.0      right.index = np.arange(len(right))
  6148         1          1.0      1.0      0.0      right_columns = right.columns
  6149         1     374354.0 374354.0     98.9      right = _generic_less_than_inequality(df, right, left_on, right_on, sort_by_appearance, strict = False)
  6150
  6151         1          2.0      2.0      0.0      if right is None:
  6152                                                   columns = df.columns.union(right_columns, sort=False)
  6153                                                   return pd.DataFrame([], columns=columns)
  6154         1          1.0      1.0      0.0      return right

In [12]:
A = pd.DataFrame(dict(
        A_id=range(10),
        A_value=range(5, 105, 10)
    ))
B = pd.DataFrame(dict(
        B_id=range(5),
        B_low=[0, 30, 30, 46, 84],
        B_high=[10, 40, 50, 54, 84]
    ))

In [13]:
A

   A_id  A_value
0     0        5
1     1       15
2     2       25
3     3       35
4     4       45
5     5       55
6     6       65
7     7       75
8     8       85
9     9       95

In [14]:
B

   B_id  B_low  B_high
0     0      0      10
1     1     30      40
2     2     30      50
3     3     46      54
4     4     84      84

In [15]:
outcome = A.le_join(B, left_on='A_value', right_on='B_high').query('A_value >= B_low')

outcome

    A_id  A_value  B_id  B_low  B_high
0      0        5     0      0      10
13     3       35     1     30      40
14     3       35     2     30      50
17     4       45     2     30      50

In [16]:
A.merge(outcome, how = 'left')

    A_id  A_value  B_id  B_low  B_high
0      0        5   0.0    0.0    10.0
1      1       15   NaN    NaN     NaN
2      2       25   NaN    NaN     NaN
3      3       35   1.0   30.0    40.0
4      3       35   2.0   30.0    50.0
5      4       45   2.0   30.0    50.0
6      5       55   NaN    NaN     NaN
7      6       65   NaN    NaN     NaN
8      7       75   NaN    NaN     NaN
9      8       85   NaN    NaN     NaN
10     9       95   NaN    NaN     NaN

In [17]:
df_a = pd.DataFrame([{"a": 1, "b": 4}, {"a": 2, "b": 5}, {"a": 3, "b": 6}])
df_b = pd.DataFrame([{"c": 2, "d": 7}, {"c": 3, "d": 8}])

In [18]:
df_a

   a  b
0  1  4
1  2  5
2  3  6

In [19]:
df_b

   c  d
0  2  7
1  3  8

In [20]:
df_a.merge(df_a.lt_join(df_b, "a", "c"), how = 'left')

   a  b    c    d
0  1  4  2.0  7.0
1  1  4  3.0  8.0
2  2  5  3.0  8.0
3  3  6  NaN  NaN

In [21]:
df1 = pd.DataFrame({'id': [1,1,1,2,2,3], 'value_1': [2,5,7,1,3,4]})
df2 = pd.DataFrame({'id': [1,1,1,1,2,2,2,3], 'value_2A': [0,3,7,12,0,2,3,1], 'value_2B': [1,5,9,15,1,4,6,3]})

In [22]:
df1

   id  value_1
0   1        2
1   1        5
2   1        7
3   2        1
4   2        3
5   3        4

In [23]:
df2

   id  value_2A  value_2B
0   1         0         1
1   1         3         5
2   1         7         9
3   1        12        15
4   2         0         1
5   2         2         4
6   2         3         6
7   3         1         3

In [24]:
df1.merge(df1.merge(df2).query('value_2A<=value_1<=value_2B'), how = 'left')

   id  value_1  value_2A  value_2B
0   1        2       NaN       NaN
1   1        5       3.0       5.0
2   1        7       7.0       9.0
3   2        1       0.0       1.0
4   2        3       2.0       4.0
5   2        3       3.0       6.0
6   3        4       NaN       NaN

In [25]:
data = """    company       date  measure
0         0  2010-01-01       10
1         0  2010-01-15       10
2         0  2010-02-01       10
3         0  2010-02-15       10
4         0  2010-03-01       10
5         0  2010-03-15       10
6         0  2010-04-01       10
7         1  2010-03-01        5
8         1  2010-03-15        5
9         1  2010-04-01        5
10        1  2010-04-15        5
11        1  2010-05-01        5
12        1  2010-05-15        5"""

left = pd.read_csv(StringIO(data), sep="\s{2,}", engine='python')

left['date'] = pd.to_datetime(left['date'])
left

    company       date  measure
0         0 2010-01-01       10
1         0 2010-01-15       10
2         0 2010-02-01       10
3         0 2010-02-15       10
4         0 2010-03-01       10
5         0 2010-03-15       10
6         0 2010-04-01       10
7         1 2010-03-01        5
8         1 2010-03-15        5
9         1 2010-04-01        5
10        1 2010-04-15        5
11        1 2010-05-01        5
12        1 2010-05-15        5

In [26]:
data = """   company   end_date
0        0  2010-02-01
1        0  2010-03-15
2        1  2010-04-01
3        1  2010-05-15
"""

right = pd.read_csv(StringIO(data), sep="\s{2,}", engine='python')

right['end_date'] = pd.to_datetime(right['end_date'])
right

   company   end_date
0        0 2010-02-01
1        0 2010-03-15
2        1 2010-04-01
3        1 2010-05-15

In [27]:
left.dtypes

company             int64
date       datetime64[ns]
measure             int64
dtype: object

In [28]:
right.dtypes

company              int64
end_date    datetime64[ns]
dtype: object

In [29]:
is_numeric_dtype(left.SALARY, right.grad)

AttributeError: 'DataFrame' object has no attribute 'SALARY'

In [ ]:
left.le_join(right, 'date', 'end_date', suffixes = (None, '_y')).loc[lambda df: (df['date'] >= (df['end_date']-pd.Timedelta('30D'))) & (df.company == df.company_y), ['company', 'date', 'end_date', 'measure']].groupby(['company', 'end_date']).measure.sum()

In [ ]:
df = pd.DataFrame({'Origin': {1: 'A', 6: 'A', 11: 'A', 16: 'A', 21: 'B', 26: 'B', 31: 'C', 36: 'C'},
 'Destination': {1: 'B', 6: 'B', 11: 'C', 16: 'C', 21: 'Z', 26: 'Z', 31: 'Z', 36: 'Z'}, 
 'Dept_Time': {1: pd.Timestamp('2019-03-30 17:31:00'), 6: pd.Timestamp('2019-05-16 17:32:00'), 11: pd.Timestamp('2019-04-01 08:30:00'), 16: pd.Timestamp('2019-06-09 08:20:00'), 21: pd.Timestamp('2019-07-26 08:31:00'), 26: pd.Timestamp('2019-03-31 06:16:00'), 31: pd.Timestamp('2019-07-03 23:52:00'), 36: pd.Timestamp('2019-03-27 17:31:00')}, 'Arrv_Time': {1: pd.Timestamp('2019-03-30 23:23:00'), 6: pd.Timestamp('2019-05-16 23:22:00'), 11: pd.Timestamp('2019-04-01 14:22:00'), 16: pd.Timestamp('2019-06-09 14:18:00'), 21: pd.Timestamp('2019-07-26 14:23:00'), 26: pd.Timestamp('2019-06-18 05:00:00'), 31: pd.Timestamp('2019-07-04 05:36:00'), 36: pd.Timestamp('2019-03-27 23:23:00')}})
df

In [ ]:
df.columns

In [ ]:
janitor.lt_join?

In [ ]:
df.lt_join(df, 'Dept_Time', 'Arrv_Time').filter(['Dept_Time_x', 'Arrv_Time_y'])

In [ ]:
df1 = pd.DataFrame({'col_a': [1,2,3], 'col_b': ["A", "B", "C"]})
df1

In [ ]:
df2 = pd.DataFrame({'col_a': [0, 2, 3], 'col_c': ["Z", "X", "Y"]})
df2

In [ ]:
df1.gt_join(df2, 'col_a', 'col_a', suffixes=(None, '_y'))

In [ ]:
TableA = pd.DataFrame(np.random.rand(4, 3),
                      pd.Index(list('abcd'), name='Key'),
                      ['A', 'B', 'C']).reset_index()
TableB = pd.DataFrame(np.random.rand(4, 3),
                      pd.Index(list('aecf'), name='Key'),
                      ['A', 'B', 'C']).reset_index()

In [ ]:
TableA

In [ ]:
TableB

In [ ]:
TableA.merge(TableB, on='Key', how='outer', indicator=True).query("_merge ==['left_only', 'right_only']")

In [ ]:
A = dict(x=[1,2,2,2,4,4,4], y=[2,3,4,6,5,5,10], z=[2,1,7,4,5,6,3])
B = dict(x=[2,4],y=[3,8])
A = pd.DataFrame(A)
B = pd.DataFrame(B)

In [ ]:
A

In [ ]:
B

In [ ]:
A=pd.concat([A]*10_000, ignore_index=True)
B= pd.concat([B]*10, ignore_index=True)

In [ ]:
%%timeit
index_to_na = A.le_join(B, "x", "x", suffixes=(None, '_y')).loc[lambda df: df.y > df.y_y, ["x", "y", "z"]]
A.loc[lambda df: df.z.isin(index_to_na.z), 'z'] = pd.NA
A

In [ ]:
A

In [ ]:
left = pd.DataFrame([[1, 2, 3],
                     [4, 5, 6],
                    [7, 8, 9]],columns=['a', 'b', 'c'])


right = pd.DataFrame([[1, 2.5, -3],
                      [4, 7, -6],
                   [6, 8.5, -9]],
                    columns=['a', 'd', 'e'])

left

In [ ]:
right

In [ ]:
left.lt_join(right, 'b', 'd').query('c>d')

In [ ]:
pd.DataFrame([[1, 2, 3, 2.5, -3]],
                     columns=['a', 'b', 'c', 'd', 'e'])

In [ ]:
data = """CHR  SNP  POS
1  rs2073813  753541
1  rs3131969  754182
2  rs3131968  754192
2  rs3131967  754334
3  rs3115859  754503
3  rs3131966  900000

"""

left = pd.read_csv(StringIO(data), sep="\s{2,}", engine='python')

left

In [ ]:
data = """CHR  start  end 
1  700500  833300
2  1000  20000
2  59998  60000 
3  700000  800000

"""

right = pd.read_csv(StringIO(data), sep="\s{2,}", engine='python')

right

In [ ]:
condition1 = lambda df: (df.POS.ge(df.start)) & (df.CHR.eq(df.CHR_y))
left.le_join(right, "POS", "end", suffixes=(None, "_y")).loc[condition1, ["CHR", "SNP", "POS"]]

In [ ]:
df1 = pd.DataFrame(
    {
        'TranDate': ['2018/01/05', '2018/02/07', '2018/03/24']
        ,'Loc': [4000, 5000, 4200]
    }
)

df2 = pd.DataFrame(
    {
        'StartDate': ['2018/01/01', '2018/02/01', '2018/03/01']
        ,'EndDate': ['2018/01/31','2018/02/28', '2018/03/30']
        ,'PP': ['01', '02', '03']
    }
)

In [ ]:
df1

In [ ]:
df2

In [ ]:
dfR = pd.DataFrame(
    {
        'TranDate': ['2018/01/05', '2018/02/07', '2018/03/24']
        ,'Loc': [4000, 5000, 4200]
        ,'PP': ['01', '02', '03']
    }
)

dfR

In [ ]:

df1['TranDate'] = pd.to_datetime(df1['TranDate'])
df1.dtypes

In [ ]:
df2.StartDate = pd.to_datetime(df2.StartDate)
df2.EndDate = pd.to_datetime(df2.EndDate)

In [ ]:
df2.dtypes

In [ ]:
df1.le_join(df2, 'TranDate', 'EndDate').loc[lambda df: df.TranDate.ge(df.StartDate), ["TranDate", "Loc", "PP"]]

In [ ]:
data = """rank    begin    end     labels
first   30953   31131    label1
first   31293   31435    label2
first   31436   31733    label4
first   31734   31754    label1
first   32841   33037    label3
second  33048   33456    label4

"""

left = pd.read_csv(StringIO(data), sep="\s{2,}", engine='python')

left

In [ ]:
data = """rank    start 
first   31333     
first   31434     
first   33039    
first   33123     
first   33125     
"""

right = pd.read_csv(StringIO(data), sep="\s{2,}", engine='python')

right

In [ ]:
left

In [ ]:
right.filter(['rank', 'start', 'labels']).merge(right.le_join(left, "start", "end", suffixes=(None, "_y")).loc[lambda df: df.start.gt(df.begin), ['rank', 'start', 'labels']], how='left')

In [ ]:
%lprun -f _conditional_merge_compute _conditional_merge_compute(df1, df2, [Inequality_Condition('y', 'foo', 'lt'), Inequality_Condition('v', 'v', 'gt')], "inner", ("_x", "_y"))